Repository: r4khul/habitwallet
Catalog: lib/l10n/app_*.arb
Languages: ta

source: Settings
ta: அமைப்புகள்

source: Language
ta: மொழி

source: Currency
ta: நாணயம்

source: Select Currency
ta: நாணயத்தைத் தேர்ந்தெடுக்கவும்

source: Theme
ta: தீம்

source: Notifications
ta: அறிவிப்புகள்

# habitCount
source: {count, plural, =0{No habits} =1{1 habit} other{{count} habits}}
ta: {count, plural, =0{பழக்கங்கள் இல்லை} =1{1 பழக்கம்} other{{count} பழக்கங்கள்}}

source: Select Language
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: English
ta: ஆங்கிலம்

source: Tamil
ta: தமிழ்

# transactionCount
source: {count, plural, =0{No transactions} =1{1 transaction} other{{count} transactions}}
ta: {count, plural, =0{பரிவர்த்தனைகள் இல்லை} =1{1 பரிவர்த்தனை} other{{count} பரிவர்த்தனைகள்}}

source: Transactions
ta: பரிவர்த்தனைகள்

source: Categories
ta: வகைகள்

source: Sync Data
ta: தரவை ஒத்திசை

source: Analytics
ta: பகுப்பாய்வு

source: Sign Out
ta: வெளியேறு

source: Welcome Back
ta: நல்வரவு

# signInToManage
source: Sign in to manage your wealth.
ta: உங்கள் செல்வத்தை நிர்வகிக்க உள்நுழையவும்.

source: Email Address
ta: மின்னஞ்சல் முகவரி

# emailRequired
source: Email is required
ta: மின்னஞ்சல் தேவை

# invalidEmail
source: Enter a valid email
ta: செல்லுபடியாகும் மின்னஞ்சலை உள்ளிடவும்

source: Security PIN
ta: பாதுகாப்பு பின்

# pinHint
source: Enter your 4-digit PIN
ta: உங்கள் 4 இலக்க பின்னை உள்ளிடவும்

# pinRequired
source: PIN is required
ta: பின் தேவை

# pinLengthError
source: PIN must be exactly 4 digits
ta: பின் சரியாக 4 இலக்கங்களாக இருக்க வேண்டும்

# rememberMe
source: Remember me on this device
ta: இந்த சாதனத்தில் என்னை நினைவில் கொள்க

source: Sign In
ta: உள்நுழைக

source: Edit Profile
ta: சுயவிவரத்தைத் திருத்து

# profileUpdated
source: Profile updated successfully!
ta: சுயவிவரம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது!

source: Save
ta: சேமி

# customizeExperience
source: Customize your experience
ta: உங்கள் அனுபவத்தைத் தனிப்பயனாக்குங்கள்

source: Display Name
ta: காட்சி பெயர்

# nameHint
source: Enter your name
ta: உங்கள் பெயரை உள்ளிடவும்

source: Yearly Savings Goal
ta: ஆண்டு சேமிப்பு இலக்கு

# savingsGoalDescription
source: Set a target for your annual savings. We'll help you track your progress in the menu.
ta: உங்கள் வருடாந்திர சேமிப்பிற்கான இலக்கை நிர்ணயிக்கவும். மெனுவில் உங்கள் முன்னேற்றத்தைக் கண்காணிக்க நாங்கள் உதவுவோம்.

source: View Financial Overview
ta: நிதி மேலோட்டத்தைப் பார்க்கவும்

source: Add Category
ta: வகையைச் சேர்

source: New Category
ta: புதிய வகை

source: Edit Category
ta: வகையைத் திருத்து

source: Delete Category
ta: வகையை நீக்கு

# deleteCategoryConfirmTitle
source: Delete Category?
ta: வகையை நீக்கவா?

# deleteCategoryConfirmMessage
source: This will permanently remove the category.
ta: இது வகையை நிரந்தரமாக அகற்றும்.

source: Category in Use
ta: வகை பயன்பாட்டில் உள்ளது

# hasTransactionsSuffix
source: has existing transactions.
ta: ஏற்கனவே பரிவர்த்தனைகளைக் கொண்டுள்ளது.

# optionMoveTransactions
source: Option 1: Move Transactions
ta: விருப்பம் 1: பரிவர்த்தனைகளை நகர்த்தவும்

# moveTransactionsDescription
source: Reassign all transactions to another category before deleting this one.
ta: இதை நீக்குவதற்கு முன் அனைத்து பரிவர்த்தனைகளையும் மற்றொரு வகைக்கு மாற்றவும்.

source: Select New Category
ta: புதிய வகையைத் தேர்ந்தெடுக்கவும்

# moveAndDelete
source: Move & Delete
ta: நகர்த்தி நீக்கு

# optionDeleteEverything
source: Option 2: Delete Everything
ta: விருப்பம் 2: அனைத்தையும் நீக்கு

# deleteEverythingDescription
source: This will permanently delete this category AND all transactions associated with it. This action cannot be undone.
ta: இது இந்த வகையையும் அதனுடன் தொடர்புடைய அனைத்து பரிவர்த்தனைகளையும் நிரந்தரமாக நீக்கும். இந்தச் செயலைத் தவிர்க்க முடியாது.

# deleteCategoryAndTransactions
source: Delete Category & Transactions
ta: வகை மற்றும் பரிவர்த்தனைகளை நீக்கு

# areYouSure
source: Are you absolutely sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

# allRecordsWillBeLost
source: All records associated with this category will be lost forever.
ta: இந்த வகையுடன் தொடர்புடைய அனைத்து பதிவுகளும் என்றென்றும் இழக்கப்படும்.

source: Delete All
ta: அனைத்தையும் நீக்கு

source: Category Name
ta: வகையின் பெயர்

source: Icon
ta: ஐகான்

source: Color
ta: நிறம்

source: Create Category
ta: வகையை உருவாக்கு

source: Save Changes
ta: மாற்றங்களைச் சேமி

source: Required
ta: தேவை

# noTransactionsAnalyze
source: No transactions to analyze
ta: பகுப்பாய்வு செய்ய பரிவர்த்தனைகள் இல்லை

source: Financial Overview
ta: நிதி மேலோட்டம்

source: Income vs Expense
ta: வருமானம் vs செலவு

source: Daily
ta: தினசரி

source: Weekly
ta: வாராந்திர

source: Monthly
ta: மாதாந்திர

source: Yearly
ta: ஆண்டு

source: Today
ta: இன்று

source: This Week
ta: இந்த வாரம்

source: This Month
ta: இந்த மாதம்

source: This Year
ta: இந்த ஆண்டு

source: All Time
ta: எல்லா நேரமும்

source: Custom Range
ta: தனிப்பயன் வரம்பு

source: No data available
ta: தரவு ஏதுமில்லை

source: Income
ta: வருமானம்

source: Expense
ta: செலவு

source: Cancel
ta: ரத்து செய்

source: Delete
ta: நீக்கு

source: EDITED
ta: திருத்தப்பட்டது

source: Error
ta: பிழை

source: Loading...
ta: ஏற்றுகிறது...

source: Try Again
ta: மீண்டும் முயலவும்

source: Version
ta: பதிப்பு

source: Backend URL
ta: பேக்கெண்ட் URL

source: Configure Backend URL
ta: பேக்கெண்ட் URL ஐ உள்ளமைக்கவும்

# dailyReminder
source: Daily Reminder (8 PM)
ta: தினசரி நினைவூட்டல் (இரவு 8 மணி)

# notifyTransactionsLogged
source: Notify if no transactions logged
ta: பரிவர்த்தனைகள் எதுவும் பதிவு செய்யப்படவில்லை என்றால் தெரிவிக்கவும்

source: General
ta: பொது

source: Network
ta: பிணையம்

source: About
ta: பற்றி

source: Edit Transaction
ta: பரிவர்த்தனையைத் திருத்தவும்

source: New Transaction
ta: புதிய பரிவர்த்தனை

source: Amount
ta: தொகை

source: Category
ta: வகை

source: Date
ta: தேதி

source: Note (Optional)
ta: குறிப்பு (விருப்பமானது)

# descriptionHint
source: Add a description...
ta: விளக்கத்தைச் சேர்க்கவும்...

source: Attachments
ta: இணைப்புகள்

source: Add
ta: சேர்

source: Add Transaction
ta: பரிவர்த்தனையைச் சேர்

# pleaseSelectCategory
source: Please select a category
ta: தயவுசெய்து ஒரு வகையைத் தேர்ந்தெடுக்கவும்

source: Error loading categories
ta: வகைகளை ஏற்றுவதில் பிழை

source: Could not open file
ta: கோப்பைத் திறக்க முடியவில்லை

source: Delete Transaction
ta: பரிவர்த்தனையை நீக்கு

# deleteTransactionConfirmTitle
source: Delete Transaction?
ta: பரிவர்த்தனையை நீக்கவா?

# deleteTransactionConfirmMessage
source: This action cannot be undone. Are you sure you want to delete this transaction?
ta: இந்தச் செயலை மாற்ற முடியாது. இந்தப் பரிவர்த்தனையை நீக்க விரும்புகிறீர்களா?

source: Transaction deleted
ta: பரிவர்த்தனை நீக்கப்பட்டது

# failedLoadCategories
source: Failed to load categories
ta: வகைகளை ஏற்றுவதில் தோல்வி

source: Something went wrong
ta: ஏதோ தவறு நடந்துவிட்டது

source: Savings Target
ta: சேமிப்பு இலக்கு

source: Surplus
ta: உபரி

source: Goal
ta: இலக்கு

source: Dark Mode
ta: இருண்ட பயன்முறை

source: Light Mode
ta: ஒளி பயன்முறை

source: User
ta: பயனர்

source: No Transactions Yet
ta: இன்னும் பரிவர்த்தனைகள் இல்லை

# startTrackingDescription
source: Start tracking your expenses and see where your money goes.
ta: உங்கள் செலவுகளைக் கண்காணிக்கத் தொடங்குங்கள் மற்றும் உங்கள் பணம் எங்கு செல்கிறது என்பதைப் பாருங்கள்.

source: Select Category
ta: வகையைத் தேர்ந்தெடுக்கவும்

source: Money Flow
ta: பணப்புழக்கம்

source: Scrollable
ta: உருட்டக்கூடியது

source: Where Your Money Goes
ta: உங்கள் பணம் எங்கே போகிறது

# analyzingFinances
source: Analyzing your finances...
ta: உங்கள் நிதியை பகுப்பாய்வு செய்கிறது...

source: Could not load analytics
ta: பகுப்பாய்வுகளை ஏற்ற முடியவில்லை

source: Net Savings
ta: நிகரச் சேமிப்பு

source: Net Deficit
ta: நிகரப் பற்றாக்குறை

# savingsRateMsg
source: You're saving {rate}% of income
ta: நீங்கள் வருமானத்தில் {rate}% சேமிக்கிறீர்கள்

source: Spending exceeds income
ta: செலவு வருமானத்தை மிஞ்சுகிறது

# notificationTitle
source: Daily Check-in üìù
ta: தினசரி சரிபார்ப்பு 📝

# notificationBody
source: Don't forget to track your income or expenses today!
ta: இன்று உங்கள் வருமானம் அல்லது செலவுகளை பதிவு செய்ய மறக்காதீர்கள்!
